Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/ИдентификаторыОбъектовДляФедеральныхМедрегистров/ИдентификаторыОбъектовДляФедеральныхМедрегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИдентификаторыОбъектовДляФедеральныхМедрегистров</name>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МоментВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментУдаления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделМедрегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Должности</types>
      <types>DocumentRef.УтверждениеШтатногоРасписания</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>DocumentRef.НачислениеЗарплаты</types>
      <types>DocumentRef.ИзменениеШтатногоРасписания</types>
      <types>CatalogRef.ОбразованиеФизическихЛиц</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/ИдентификаторыОбъектовДляФедеральныхМедрегистров/Forms/ВыборПодразделенияФРМО/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ИдентификаторПодразделенияИБ", ИдентификаторПодразделенияИБ);
	ПодразделенияФРМО = Неопределено;
	Если Параметры.Свойство("ПодразделенияФРМО", ПодразделенияФРМО) Тогда
		ТаблицаПодразделений = Новый ТаблицаЗначений; //Наименование,Идентификатор,Уровень,Родитель,СтруктураПодразделения - Наименование,Идентификатор
		ТаблицаПодразделений.Колонки.Добавить("Уровень", ОбщегоНазначения.ОписаниеТипаЧисло(2));
		ТаблицаПодразделений.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаПодразделений.Колонки.Добавить("Родитель", ОбщегоНазначения.ОписаниеТипаСтрока(50));
		ТаблицаПодразделений.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(250)); 
		ТаблицаПодразделений.Колонки.Добавить("СтруктураПодразделения", Новый ОписаниеТипов("ТаблицаЗначений"));
		Для Каждого ТекущееПодразделение Из ПодразделенияФРМО Цикл 
			НовоеПодразделение = ТаблицаПодразделений.Добавить();
		    ЗаполнитьЗначенияСвойств(НовоеПодразделение, ТекущееПодразделение, , "СтруктураПодразделения"); 
			ТаблицаОтделений = Новый ТаблицаЗначений;
			ТаблицаОтделений.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(50));
			ТаблицаОтделений.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(250)); 
			Для Каждого ТекущееОтделение Из ТекущееПодразделение.СтруктураПодразделения Цикл 
				НовоеОтделение = ТаблицаОтделений.Добавить();
		    	ЗаполнитьЗначенияСвойств(НовоеОтделение, ТекущееОтделение); 
			КонецЦикла;
			НовоеПодразделение.СтруктураПодразделения = ТаблицаОтделений;
		КонецЦикла;
		ТаблицаПодразделений.Сортировать("Уровень,Наименование");
		
		Родители = Новый Соответствие;
		НовыеРодители = Новый Соответствие;
		ПредыдущийУровень = 0;
		Для Каждого ТекущееПодразделение Из ТаблицаПодразделений Цикл 
			Если ПредыдущийУровень<ТекущееПодразделение.Уровень Тогда 
				Родители = Новый ФиксированноеСоответствие(НовыеРодители);
			    ПредыдущийУровень = ТекущееПодразделение.Уровень;
				НовыеРодители.Очистить();
			КонецЕсли;
			Если ТекущееПодразделение.Уровень = 1 Тогда 
				НовоеПодразделение = Подразделения.ПолучитьЭлементы().Добавить();
				НовыеРодители.Вставить(ТекущееПодразделение.Идентификатор, НовоеПодразделение.ПолучитьИдентификатор());
			Иначе 
				ИдентификаторРодителя = Родители.Получить(ТекущееПодразделение.Родитель);
				Если ИдентификаторРодителя<>Неопределено Тогда 
					РодительскоеПодразделение = Подразделения.НайтиПоИдентификатору(ИдентификаторРодителя);
					НовоеПодразделение = РодительскоеПодразделение.ПолучитьЭлементы().Добавить();
					НовыеРодители.Вставить(ТекущееПодразделение.Идентификатор, НовоеПодразделение.ПолучитьИдентификатор());
				Иначе 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НовоеПодразделение, ТекущееПодразделение);
			НовоеПодразделение.ЭтоОтделениеИлиКабинет = Ложь;
			Для Каждого ЭлементСтруктурыПодразделения Из ТекущееПодразделение.СтруктураПодразделения Цикл 
				НовыйЭлементСтруктурыПодразделения = НовоеПодразделение.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлементСтруктурыПодразделения, ЭлементСтруктурыПодразделения);
				НовыйЭлементСтруктурыПодразделения.ЭтоОтделениеИлиКабинет = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыбореПодразделения();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОповеститьОВыбореПодразделения()
	
	ТекущиеДанные = Элементы.Подразделения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемаяСтруктура = Новый Структура;
	ПередаваемаяСтруктура.Вставить("ИдентификаторПодразделенияИБ", ИдентификаторПодразделенияИБ);
	
	ДочерниеЭлементы = ТекущиеДанные.ПолучитьЭлементы();
	Если ДочерниеЭлементы.Количество()=0 Тогда
		РодительскийЭлемент = ТекущиеДанные.ПолучитьРодителя();
		Если РодительскийЭлемент<>Неопределено И ТекущиеДанные.ЭтоОтделениеИлиКабинет Тогда 
			ПередаваемаяСтруктура.Вставить("Наименование", РодительскийЭлемент.Наименование);
			ПередаваемаяСтруктура.Вставить("Идентификатор", РодительскийЭлемент.Идентификатор);
			ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", ТекущиеДанные.Наименование);
			ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", ТекущиеДанные.Идентификатор);
		Иначе 
			ПередаваемаяСтруктура.Вставить("Наименование", ТекущиеДанные.Наименование);
			ПередаваемаяСтруктура.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
			ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", "");
			ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", "");
		КонецЕсли;
	Иначе 
		ПередаваемаяСтруктура.Вставить("Наименование", ТекущиеДанные.Наименование);
		ПередаваемаяСтруктура.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
		ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", "");
		ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", "");
	КонецЕсли;
	
	Закрыть(ПередаваемаяСтруктура);
	
КонецПроцедуры
